Конфигурация/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Enums/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователей</name>
  <enumValues>
    <name>Админ</name>
  </enumValues>
  <enumValues>
    <name>Курьер</name>
  </enumValues>
  <enumValues>
    <name>МенеджерПриемаЗаказов</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
// @strict-types

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ИдентификаторПользователя = ТекущийОбъект.ИдентификаторПользователяИБ;
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователя);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	Пользователь.АутентификацияСтандартная = ДоступРазрешён;
	Пользователь.ПолноеИмя = Объект.Наименование;
	Пользователь.Имя = Логин;
	
	Если ПарольУстановлен Тогда
		Пользователь.Пароль = Пароль;
	КонецЕсли;
	
	Пользователь.Роли.Очистить();
	
	Если РольПользователя = Перечисления.РолиПользователей.Админ Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Админ);
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.МенеджерПриемаЗаказов Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.МенеджерПриемаЗаказов);
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.Курьер Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Курьер);
	КонецЕсли;

	Пользователь.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = Пользователь.УникальныйИдентификатор;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ИдентификаторПользователя = ТекущийОбъект.ИдентификаторПользователяИБ;
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователя);
	
	Если Пользователь = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступРазрешён = Пользователь.АутентификацияСтандартная;
	Логин = Пользователь.Имя;
	
	Если ЗначениеЗаполнено(Пользователь.СохраняемоеЗначениеПароля) Тогда
		Пароль = "**********";
	КонецЕсли;
	
	ЭтоАдмин = Ложь;
	ЭтоМенеджерПриемаЗаказов = Ложь;
	ЭтоКурьер = Ложь;
	
	Для Каждого Роль Из Пользователь.Роли Цикл
		
		Если Роль = Метаданные.Роли.Админ Тогда
			ЭтоАдмин = Истина
		ИначеЕсли Роль = Метаданные.Роли.МенеджерПриемаЗаказов Тогда
			ЭтоМенеджерПриемаЗаказов = Истина
		ИначеЕсли Роль = Метаданные.Роли.Курьер Тогда
			ЭтоКурьер = Истина
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоАдмин Тогда
		РольПользователя = Перечисления.РолиПользователей.Админ
	ИначеЕсли ЭтоМенеджерПриемаЗаказов Тогда
		РольПользователя = Перечисления.РолиПользователей.МенеджерПриемаЗаказов
	ИначеЕсли ЭтоКурьер Тогда
		РольПользователя = Перечисления.РолиПользователей.Курьер
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Пароль = "**********";
	Элементы.Пароль.РежимПароля = Истина;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностьюЭлементов(ДоступРазрешён, Элементы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольУстановлен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступРазрешёнПриИзменении(Элемент)
	УправлениеДоступностьюЭлементов(ДоступРазрешён, Элементы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаколдуйПароль(Команда)
	
	Пароль = НаколдуйПарольНаСервере();
	ПарольУстановлен = Истина;
	Элементы.Пароль.РежимПароля = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НаколдуйПарольНаСервере()
	
	ГСП = Новый ГенераторСлучайныхПаролей();
	Возврат ГСП.СлучайныйПароль(12, Истина);

КонецФункции

// Управление доступностью элементов.
// 
// Параметры:
//  ДоступРазрешён - Булево
//  ЭлементыФормы - ВсеЭлементыФормы
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностьюЭлементов(ДоступРазрешён, ЭлементыФормы)

	ЭлементыФормы.Логин.Доступность = ДоступРазрешён;
	ЭлементыФормы.ГруппаПароль.Доступность = ДоступРазрешён;
	ЭлементыФормы.РольПользователя.Доступность = ДоступРазрешён;

КонецПроцедуры

#КонецОбласти
